bench/custom/logs/rfuse/ramdisk/libaio/rfuse_write_0-1.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=6466: Wed May 29 15:42:48 2024
  write: IOPS=27.2k, BW=106MiB/s (112MB/s)(32.0GiB/308009msec); 0 zone resets
    slat (usec): min=7, max=156373, avg=897.82, stdev=1109.01
    clat (nsec): min=298, max=313266, avg=551.81, stdev=182.63
     lat (usec): min=8, max=156375, avg=898.37, stdev=1109.04
    clat percentiles (nsec):
     |  1.00th=[  374],  5.00th=[  474], 10.00th=[  494], 20.00th=[  506],
     | 30.00th=[  516], 40.00th=[  524], 50.00th=[  532], 60.00th=[  540],
     | 70.00th=[  564], 80.00th=[  588], 90.00th=[  644], 95.00th=[  708],
     | 99.00th=[  860], 99.50th=[  940], 99.90th=[ 1176], 99.95th=[ 1304],
     | 99.99th=[ 3120]
   bw (  KiB/s): min=117098, max=921308, per=100.00%, avg=259188.62, stdev=3733.37, samples=15021
   iops        : min=29268, max=230318, avg=64788.02, stdev=933.34, samples=15021
  lat (nsec)   : 500=14.16%, 750=82.70%, 1000=2.82%
  lat (usec)   : 2=0.29%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=0.11%, sys=7.65%, ctx=935164751, majf=0, minf=483
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=106MiB/s (112MB/s), 106MiB/s-106MiB/s (112MB/s-112MB/s), io=32.0GiB (34.4GB), run=308009-308009msec