bench/custom/logs/rfuse/ramdisk/libaio/rfuse_write_0-15.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=7120: Wed May 29 15:53:01 2024
  write: IOPS=123k, BW=480MiB/s (504MB/s)(32.0GiB/68227msec); 0 zone resets
    slat (usec): min=6, max=38630, avg=217.10, stdev=359.48
    clat (nsec): min=295, max=4164.9k, avg=397.02, stdev=2011.46
     lat (usec): min=7, max=38632, avg=217.49, stdev=359.52
    clat percentiles (nsec):
     |  1.00th=[  334],  5.00th=[  342], 10.00th=[  346], 20.00th=[  358],
     | 30.00th=[  366], 40.00th=[  370], 50.00th=[  378], 60.00th=[  386],
     | 70.00th=[  402], 80.00th=[  426], 90.00th=[  454], 95.00th=[  490],
     | 99.00th=[  636], 99.50th=[  756], 99.90th=[ 1144], 99.95th=[ 1960],
     | 99.99th=[ 3728]
   bw (  KiB/s): min=319673, max=2233645, per=100.00%, avg=648669.55, stdev=12880.50, samples=3638
   iops        : min=79911, max=558410, avg=162166.22, stdev=3220.13, samples=3638
  lat (nsec)   : 500=95.74%, 750=3.75%, 1000=0.34%
  lat (usec)   : 2=0.12%, 4=0.04%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%
  lat (msec)   : 10=0.01%
  cpu          : usr=0.38%, sys=54.22%, ctx=1076994344, majf=0, minf=864
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=480MiB/s (504MB/s), 480MiB/s-480MiB/s (504MB/s-504MB/s), io=32.0GiB (34.4GB), run=68227-68227msec