bench/custom/logs/rfuse/ramdisk/libaio/rfuse_write_0-31.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=7360: Wed May 29 15:55:25 2024
  write: IOPS=123k, BW=481MiB/s (504MB/s)(32.0GiB/68155msec); 0 zone resets
    slat (usec): min=8, max=47802, avg=248.11, stdev=355.56
    clat (nsec): min=316, max=3991.7k, avg=575.55, stdev=1820.28
     lat (usec): min=8, max=47810, avg=248.68, stdev=355.62
    clat percentiles (nsec):
     |  1.00th=[  354],  5.00th=[  370], 10.00th=[  382], 20.00th=[  394],
     | 30.00th=[  410], 40.00th=[  466], 50.00th=[  588], 60.00th=[  668],
     | 70.00th=[  692], 80.00th=[  716], 90.00th=[  764], 95.00th=[  812],
     | 99.00th=[ 1004], 99.50th=[ 1176], 99.90th=[ 2128], 99.95th=[ 2608],
     | 99.99th=[ 4640]
   bw (  KiB/s): min=312073, max=1320892, per=100.00%, avg=512277.14, stdev=7065.30, samples=4167
   iops        : min=78018, max=330222, avg=128069.18, stdev=1766.32, samples=4167
  lat (nsec)   : 500=44.12%, 750=43.99%, 1000=10.87%
  lat (usec)   : 2=0.90%, 4=0.11%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  lat (msec)   : 4=0.01%
  cpu          : usr=0.50%, sys=87.37%, ctx=326662940, majf=0, minf=757
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=481MiB/s (504MB/s), 481MiB/s-481MiB/s (504MB/s-504MB/s), io=32.0GiB (34.4GB), run=68155-68155msec